tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Arduino command-line interface
brew "arduino-cli"
# Automatic configure script builder
brew "autoconf"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Small static webserver without CGI
brew "darkhttpd"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang@25"
# Modern, maintained replacement for ls
brew "eza"
# Free lossless audio codec
brew "flac"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Fast linters runner for Go
brew "golangci-lint"
# C websockets server library
brew "libwebsockets"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Cross-platform library for audio I/O
brew "portaudio"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
# UNIX shell (command interpreter)
brew "zsh"
# SDK
brew "dart-lang/dart/dart"