tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Arduino command-line interface
brew "arduino-cli"
# Automatic configure script builder
brew "autoconf"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang@25"
# Modern, maintained replacement for ls
brew "eza"
# Free lossless audio codec
brew "flac"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# C websockets server library
brew "libwebsockets"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Cross-platform library for audio I/O
brew "portaudio"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
vscode "aeschli.vscode-css-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "batisteo.vscode-django"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "Dart-Code.dart-code"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.intelli-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "icrawl.discord-vscode"
vscode "Ionide.Ionide-fsharp"
vscode "JakeBecker.elixir-ls"
vscode "KevinRose.vsc-python-indent"
vscode "magicstack.MagicPython"
vscode "marp-team.marp-vscode"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "msjsdiag.vscode-react-native"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "phoenixframework.phoenix"
vscode "PKief.material-icon-theme"
vscode "Postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "PulkitGangwar.nextjs-snippets"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "SimonSiefke.svg-preview"
vscode "steoates.autoimport"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "Tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "xicunyang.symbolic-link-jump"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
